renesas/cpk_examples/cpknet_ra8t2/sci_uart_cpknet_ra8t2_ep/e2studio_llvm/src/hal_entry.c
#include "console.h"
#include "hal_data.h"
#include"perf_uart.h"
#include "coremark/coremark.h"
#include "perf_counter/perf_counter.h"
#include "common_utils.h"
#if (1 == BSP_MULTICORE_PROJECT) && BSP_TZ_SECURE_BUILD
bsp_ipc_semaphore_handle_t g_core_start_semaphore =
{
    .semaphore_num = 0
};
#endif
#define BSP_PRV_PRCR_KEY1                        (0xA500U)
#define BSP_PRV_PRCR_UNLOCK1                     ((BSP_PRV_PRCR_KEY1) | 0x3U)
#define BSP_PRV_PRCR_LOCK1                       ((BSP_PRV_PRCR_KEY1) | 0x0U)
/*******************************************************************************************************************//**
 * main() is generated by the RA Configuration editor and is used to generate threads if an RTOS is used.  This function
 * is called by main() when no RTOS is used.
 **********************************************************************************************************************/
void hal_entry(void)
{
    /* TODO: add your own code here */
    CONSOLE_Init();
    perfc_init(false);
    printf(BANNER_INFO);
    uart_initialize();

    /* 等待任意输入，如果不需要，这个 while 循环可以删除 */
    printf("Input any character to start UART test\r\n");
    while (1) {
        R_BSP_SoftwareDelay(2, BSP_DELAY_UNITS_SECONDS);
        if (CONSOLE_HasData()) {
            break;
        }
        else {
            //printf("Input any character to start UART test\r\n");
        }
    }
    printf("\r\nUART test running, please wait...\r\n");
    uart_perf_test();
    while (1) {
        R_IOPORT_PinWrite(g_ioport.p_ctrl, USER_LED, BSP_IO_LEVEL_HIGH);
        R_BSP_SoftwareDelay(500, BSP_DELAY_UNITS_MILLISECONDS);
        R_IOPORT_PinWrite(g_ioport.p_ctrl, USER_LED, BSP_IO_LEVEL_LOW);
        R_BSP_SoftwareDelay(500, BSP_DELAY_UNITS_MILLISECONDS);
    }

    /* Wake up 2nd core if this is first core and we are inside a multicore project. */
#if (0 == _RA_CORE) && (1 == BSP_MULTICORE_PROJECT) && !BSP_TZ_NONSECURE_BUILD

#if BSP_TZ_SECURE_BUILD
    /* Take semaphore so 2nd core can clear it */
    R_BSP_IpcSemaphoreTake(&g_core_start_semaphore);
#endif

    R_BSP_SecondaryCoreStart();

#if BSP_TZ_SECURE_BUILD
    /* Wait for 2nd core to start and clear semaphore */
    while(FSP_ERR_IN_USE == R_BSP_IpcSemaphoreTake(&g_core_start_semaphore))
    {
        ;
    }
#endif
#endif

#if (1 == _RA_CORE) && (1 == BSP_MULTICORE_PROJECT) && BSP_TZ_SECURE_BUILD
    /* Signal to 1st core that 2nd core has started */
    R_BSP_IpcSemaphoreGive(&g_core_start_semaphore);
#endif

#if BSP_TZ_SECURE_BUILD
    /* Enter non-secure code */
    R_BSP_NonSecureEnter();
#endif
}

#if BSP_TZ_SECURE_BUILD

FSP_CPP_HEADER
BSP_CMSE_NONSECURE_ENTRY void template_nonsecure_callable ();

/* Trustzone Secure Projects require at least one nonsecure callable function in order to build (Remove this if it is not required to build). */
BSP_CMSE_NONSECURE_ENTRY void template_nonsecure_callable ()
{

}
FSP_CPP_FOOTER

#endif
